pages/18_Round_Edale_Walk.html
<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml"
      xmlns:og="http://ogp.me/ns#"
      xmlns:fb="https://www.facebook.com/2008/fbml">
<head>
    <title>Round Edale Walk.</title>
    <!-- Using the latest rendering mode for IE -->
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

    <!-- Open Graph tags -->

            <meta property="og:type" content="article"/>
            <meta property="og:title" content="Round Edale Walk."/>
            <meta property="og:url" content="http://thecastle.github.io/thecastle/pages/18_Round_Edale_Walk.html"/>

    <!-- Bootstrap -->
        <link rel="stylesheet" href="http://thecastle.github.io/thecastle/theme/css/bootstrap.readable.min.css" type="text/css"/>
    <link href="http://thecastle.github.io/thecastle/theme/css/font-awesome.min.css" rel="stylesheet">
    <link href="http://thecastle.github.io/thecastle/theme/css/pygments.css" rel="stylesheet">
    <link rel="stylesheet" href="http://thecastle.github.io/thecastle/theme/css/style.css" type="text/css"/>
    <!-- JavaScript plugins (requires jQuery) -->


</head>
<body>
<nav class="navbar navbar-default navbar-fixed-top" role="navigation">
    <div class="container">
        <div class="navbar-header">
            <button type="button" class="navbar-toggle" data-toggle="collapse" data-target=".navbar-ex1-collapse">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a href="http://thecastle.github.io/thecastle" class="navbar-brand">The Castle Mountaineering Club.</a>
        </div>
        <div class="collapse navbar-collapse navbar-ex1-collapse">
            <ul class="nav navbar-nav">
            </ul>
            <ul class="nav navbar-nav navbar-right">
                <li><a href="http://thecastle.github.io/thecastle/archives.html"><i class="icon-th-list"></i>Archives</a></li>
            </ul>
        </div>
        <!-- /.navbar-collapse -->
    </div>
</nav>
<!-- /.navbar -->
<div class="container">
    <div class="row">
        <div class="col-lg-9">
    <section id="content" class="body">

        <div class="entry-content">
            
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Round Edale Walk or &ldquo;Who Went Where and Who Said What?&rdquo;</h2>
<div class="outline-text-2" id="text-1">
<div class="export">
<p>
&lt;p&gt;
&lt;em&gt;by Jack Ashcroft&lt;/em&gt;
&lt;/p&gt;
</p>

</div>

<p>
An innocent enough walk around Edale.
&ldquo;You can&rsquo;t get lost up there,&rdquo; was the bar room atmosphere
at half past ten on Thursday evening.
Well you can. If you don&rsquo;t take your map and compass,
whistle, torch, contact lenses   if appropriate  and it&rsquo;s
raining, the cloud banks are low, the gale force on the Beaufort
Scale is approaching eight and you don&rsquo;t check your position
regularly and keep the group together&#x2026;
</p>

<p>
Ten of us left Mam Nick car park at 8.45 am to tackle the
Walk clockwise. Before Lords Seat the furious Westerly had us
reeling and two returned to the car park. Eight then battled on
for Brown Knoll   a little spread out   but on arrival at the
trig point we were only six in number. We got cold standing there
in the wind, straining our eyes through the mist for the other
two, both ladies. Concern.
</p>

<p class="verse">
&ldquo;Secretaries are dispensable.&rdquo;  E<br  />
</p>


<p>
&#x2026;mutter&#x2026;  mutter&#x2026;  mutter&#x2026;  J
</p>
<p class="verse">
&ldquo;Let&rsquo;s push off in the true spirit of mountaineering<br  />
comradeship.&rdquo;<br  />
</p>

<p class="verse">
&ldquo;Here they are.&rdquo;<br  />
</p>


<p>
Two figures loomed out of the mist. But it wasn&rsquo;t them.
</p>
<p class="verse">
&ldquo;We haven&rsquo;t seen them    we followed the path all the way.&rdquo;<br  />
</p>

<p>
So we were eight again, but a different eight.
</p>
<p class="verse">
&ldquo;Hope they are together.&rdquo;<br  />
&ldquo;She&rsquo;s never been up here before   hasn&rsquo;t got a map.&rdquo;  E<br  />
&ldquo;She knows the topography   she&rsquo;s got common sense.&rdquo;  E<br  />
</p>

<p class="verse">
&ldquo;Your decision.&rdquo;<br  />
&ldquo;Let&rsquo;s go on and see what happens.&rdquo;<br  />
</p>
<p>
We walk on to Edale Cross.
</p>

<p class="verse">
&ldquo;They&rsquo;re here.&rdquo;<br  />
&ldquo;You&rsquo;re disqualified   missed out Brown Knoll check point.&rdquo;<br  />
<br  />
</p>

<p class="verse">
&ldquo;Rubbish, we followed the right hand side of the dyke.<br  />
Pointless going off route to the trig point.&rdquo;<br  />
&ldquo;We really will keep together now.&rdquo;<br  />
</p>

<p>
And we basically did&#x2026; to the shelter of the boulders below
The Pagoda.
</p>

<p class="verse">
&ldquo;I&rsquo;ve just been talking to someone up there who I<br  />
thought was one of us until I pushed my nose into his<br  />
face.&rdquo;<br  />
&ldquo;We need a Kinder sixth sense move to the top of<br  />
Grindsbrook. We&rsquo;ll stop there for a bite to eat.&rdquo;<br  />
&ldquo;OK, it&rsquo;s alright. Don&rsquo;t bother to get your map out.&rdquo;<br  />
So ten set swiftly off into the wind, rain and mist, full of<br  />
confidence.<br  />
</p>

<p class="verse">
&ldquo;It&rsquo;s rough going. Too much up and down the groughs.&rdquo;<br  />
&ldquo;Stop. Let&rsquo;s think where we are.&rdquo;<br  />
&ldquo;More to the right.&rdquo;<br  />
&ldquo;Up to the left.&rdquo;<br  />
&ldquo;We&rsquo;ve lost them now.&rdquo;<br  />
</p>
<p>
Five of us left.
</p>

<p class="verse">
&ldquo;Let&rsquo;s stick together.&rdquo;<br  />
&ldquo;The stream is going north. This must be the Kinder<br  />
River.&rdquo;<br  />
&ldquo;This way.&rdquo;<br  />
&ldquo;Move south.&rdquo;<br  />
&ldquo;No. Move over. Still more east.&rdquo;<br  />
&ldquo;It&rsquo;s like caving above ground.&rdquo;<br  />
&ldquo;Drop into the groughs at the head of Grindsbrook.&rdquo;<br  />
&ldquo;This is it.&rdquo;<br  />
&ldquo;Damn! It&rsquo;s Crowden Brook, not Grindsbrook.&rdquo;<br  />
&ldquo;We&rsquo;ve gone round in circles.&rdquo;<br  />
&ldquo;No we haven&rsquo;t! Just a horseshoe   a mile to progress<br  />
half a mile.&rdquo;<br  />
&ldquo;Are we stopping to dry out tights and long johns?&rdquo;<br  />
&ldquo;I wear socks the same as every one else.&rdquo;<br  />
&ldquo;The feminist touch.&rdquo;<br  />
&ldquo;Right, now for Grindsbrook, I bet someone&rsquo;s there.&rdquo;<br  />
</p>
<p>
Someone was.
</p>
<p class="verse">
&ldquo;I&rsquo;ve been here five or ten minutes. Dropped into the<br  />
groughs head of Grindsbrook on a compass bearing. I<br  />
haven&rsquo;t a map.&rdquo;<br  />
</p>

<p>
It was 12.38 pm.
</p>

<p class="verse">
&ldquo;Don&rsquo;t go down there. It&rsquo;s best to wait until we get to<br  />
Golden Clough if you want to go down.&rdquo;<br  />
Six of us stood at the top of Golden Clough.<br  />
&ldquo;Who&rsquo;s for going down?&rdquo;<br  />
&ldquo;Well&#x2026;&rdquo;<br  />
&ldquo;Tea in Coppers.&rdquo;<br  />
&ldquo;Newcastle Brown in The Nags.&rdquo;<br  />
&ldquo;You can tell who are the walkers!&rdquo;<br  />
&ldquo;You can tell who are the climbers!&rdquo;<br  />
&ldquo;Who&rsquo;s doing what?&rdquo;   &ldquo;That&rsquo;s it then.&rdquo;<br  />
Two went down for refreshment. Four went on. Too swiftly again, I<br  />
fear.<br  />
&ldquo;We haven&rsquo;t seen the trig point.&rdquo;<br  />
&ldquo;It&rsquo;s over there.&rdquo;<br  />
&ldquo;This is the head of Jaggers.&rdquo;<br  />
&ldquo;Doesn&rsquo;t seem deep enough to me.&rdquo;<br  />
</p>
<p>
Neither was it.
</p>

<p class="verse">
&ldquo;That&rsquo;s the Snake road down there and we are walking<br  />
out.&rdquo;<br  />
&ldquo;It&rsquo;s Blackden.&rdquo;<br  />
&ldquo;Turn around for Crookstone Knoll.&rdquo;<br  />
&ldquo;I&rsquo;ll watch her down there and you up here   keep in<br  />
contact.&rdquo;<br  />
&ldquo;You can get off the plateau but you may be fifteen<br  />
miles from where you want to be.&rdquo;<br  />
</p>

<p>
And so off the plateau towards Crookstone Barn. Two lasses and
two lads.
</p>

<p class="verse">
&ldquo;Those trees must be two of the toughest in the Peak.&rdquo;<br  />
&ldquo;Down the Roman Road to meet the car at The Cheshire<br  />
Cheese.&rdquo;<br  />
&ldquo;There&rsquo;s a quicker route than that.&rdquo;<br  />
&ldquo;Oh! Someone has moved the fence.&rdquo;<br  />
</p>

<p>
And so we were on the road at Edale End. The two lads approached
Lose Hill under the railway near Fiddle Clough. It was 3.20 pm.
The two lasses walked along the road to meet their transport at
The Cheshire Cheese.
</p>

<p>
Lose Hill wasn&rsquo;t in fact traversed by both the lads: one
followed the track around the south side of Lose Hill into the
wind. Slow tiring progress.
</p>

<p class="verse">
&ldquo;I waited here out of the wind so we&rsquo;d be together to<br  />
traverse Mam Tor. It looks vicious up there.&rdquo;<br  />
<br  />
</p>
<p>
And so it was. Racing cloud touching the summit, the light
gone, crawling on hands and knees. It was 5.05 pm. The rest of
the cars had gone.
</p>
<p class="verse">
&ldquo;I&rsquo;ve never been in wind like that before.&rdquo;<br  />
</p>

<p>
And who sheltered at Kinder Downfall for lunch and never saw
Crowden Brook or Grindsbrook at all? What a Who dunnit! Oh the
freedom of the hills! u  I call an EGM. The motion:
</p>
<p class="verse">
&ldquo;The CMC should affiliate to the British Orienteering<br  />
Association.&rdquo;<br  />
<br  />
</p>
<p>
Proposed   Guess Who?
Seconded   Get Lost! Plus ten supporting Kinder members.
</p>
</div>
</div>

        </div>
    </section>
        </div>
        <div class="col-lg-3 well well-sm" id="sidebar">

<aside>
    <section>

        <ul class="list-group list-group-flush">
             <li class="list-group-item"><h4><i class="icon-search icon-large"></i>Search</h4></li>

                   <li class="list-group-item"><h4><i class="icon-book icon-large"></i>Pages</h4></li>



                <li class="list-group-item"><a href="http://thecastle.github.io/thecastle/tags.html"><h4><i class="icon-tags icon-large"></i>Tags</h4></a></li>
        </ul>
    </section>
</aside>        </div>
    </div>
</div>
<footer>
    <div class="container">
        <hr>
        <p class="pull-right"><i class="icon-arrow-up"></i> <a href="#">Back to top</a></p>


        <p>&copy;  The Castle Mountaineering Club. &middot; Powered by <a href="https://github.com/DandyDev/pelican-bootstrap3" target="_blank">pelican-bootstrap3</a>,
            <a href="http://docs.getpelican.com/" target="_blank">Pelican</a>,
            <a href="http://getbootstrap.com" target="_blank">Bootstrap</a></p>
    </div>
</footer>
<!-- Include all compiled plugins (below), or include individual files as needed -->
<script src="http://thecastle.github.io/thecastle/theme/js/bootstrap.min.js"></script>

<!-- Enable responsive features in IE8 with Respond.js (https://github.com/scottjehl/Respond) -->
<script src="http://thecastle.github.io/thecastle/theme/js/respond.min.js"></script>


</body>
</html>